src/Documents/ВыездСПарковки/ВыездСПарковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыездСПарковки</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ЗанятостьМест/ЗанятостьМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятостьМест</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВыездСПарковки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения          = ВидДвиженияНакопления.Расход;
	Движение.Период               = Дата;
	Движение.Организация          = Организация;
	Движение.Территория           = Территория;
	Движение.Площадка             = Площадка;
	Движение.Ряд                  = Ряд;
	Движение.Место                = Место;
	Движение.Состояние            = 1;
	Движение.Контрагент           = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;
	
КонецПроцедуры
